---
title: üåê Red
---

# üåê Red

## 1. `ipconfig` 

Muestra informaci√≥n sobre la configuraci√≥n IP del sistema.

| Comando              | Descripci√≥n                                          |
| -------------------- | ---------------------------------------------------- |
| `ipconfig`           | Muestra la configuraci√≥n b√°sica de red               |
| `ipconfig /all`      | Muestra informaci√≥n detallada (MAC, DNS, DHCP, etc.) |
| `ipconfig /release`  | Libera la direcci√≥n IP obtenida por DHCP             |
| `ipconfig /renew`    | Solicita una nueva direcci√≥n IP al servidor DHCP     |
| `ipconfig /flushdns` | Limpia la cach√© de DNS local                         |

**Ejemplos combinados:**

```cmd
ipconfig /all
```

> Muestra toda la informaci√≥n de red detallada de cada adaptador.

```cmd
ipconfig /flushdns
```

> Limpia la cach√© DNS, √∫til cuando hay problemas de resoluci√≥n de nombres.
 ## 2. `ping` 

Env√≠a paquetes ICMP a un destino para comprobar si hay respuesta.

| Comando                 | Descripci√≥n                                                  |
| ----------------------- | ------------------------------------------------------------ |
| `ping google.com`       | Env√≠a 4 paquetes a `google.com`                              |
| `ping 8.8.8.8`          | Comprueba conexi√≥n directa por IP                            |
| `ping -t google.com`    | Env√≠a pings continuos hasta que se interrumpa con `Ctrl + C` |
| `ping -n 10 google.com` | Env√≠a 10 paquetes                                            |

**Ejemplos combinados:**

```cmd
ping -n 5 1.1.1.1
```

> Env√≠a 5 paquetes a la IP de Cloudflare (`1.1.1.1`).

```cmd
ping -t google.com
```

> Realiza pings continuos a Google para comprobar la estabilidad de la conexi√≥n.
 ## 3. `tracert` 

Muestra los saltos que siguen los paquetes hasta llegar al destino.

| Comando                 | Descripci√≥n                                                |
| ----------------------- | ---------------------------------------------------------- |
| `tracert google.com`    | Muestra la ruta de red hasta `google.com`                  |
| `tracert -d google.com` | No resuelve nombres de host, solo muestra IPs (m√°s r√°pido) |

**Ejemplo:**

```cmd
tracert -d openai.com
```

> Rastrea la ruta hacia `openai.com` mostrando √∫nicamente direcciones IP.
 ## 4. `netstat` 

Muestra informaci√≥n sobre conexiones TCP/UDP y puertos en uso.

| Comando       | Descripci√≥n                                          |
| ------------- | ---------------------------------------------------- |
| `netstat`     | Muestra conexiones activas                           |
| `netstat -a`  | Muestra todas las conexiones y puertos en escucha    |
| `netstat -n`  | Muestra direcciones IP en formato num√©rico           |
| `netstat -o`  | Incluye el PID del proceso que usa la conexi√≥n       |
| `netstat -an` | Combinaci√≥n com√∫n: muestra todo, en formato num√©rico |

**Ejemplos combinados:**

```cmd
netstat -an | find "LISTEN"
```

> Muestra √∫nicamente las conexiones en estado de escucha.

```cmd
netstat -ano > conexiones.txt
```

> Guarda todas las conexiones y puertos activos en un archivo de texto.
 ## 5. `nslookup` 

Consulta informaci√≥n DNS sobre un dominio o direcci√≥n IP.

| Comando                       | Descripci√≥n                                    |
| ----------------------------- | ---------------------------------------------- |
| `nslookup google.com`         | Muestra la IP asociada a un dominio            |
| `nslookup 8.8.8.8`            | Muestra el dominio asociado a una IP (inversa) |
| `nslookup -type=MX gmail.com` | Muestra los registros de correo (MX)           |

**Ejemplos combinados:**

```cmd
nslookup -type=TXT openai.com
```

> Consulta los registros TXT del dominio (por ejemplo, claves SPF o verificaci√≥n de dominio).
 ## 6. `arp` 

Tabla ARP (asociaciones IP ‚Üî MAC)

| Comando                                 | Descripci√≥n                    |
| --------------------------------------- | ------------------------------ |
| `arp -a`                                | Muestra la tabla ARP actual    |
| `arp -d *`                              | Elimina todas las entradas ARP |
| `arp -s 192.168.1.50 00-AA-BB-CC-DD-EE` | A√±ade una entrada ARP manual   |

**Ejemplos:**

```cmd
arp -a
```

 ## üí° Consejos √∫tiles

- Usa `Ctrl + C` para detener comandos como `ping -t`.
    
- `ipconfig /flushdns` ayuda a resolver errores al acceder a p√°ginas web.
    
- Combina `netstat` con `find` para buscar procesos o puertos espec√≠ficos.
    
    
 