---
title: ğŸŒ Red
---

# ğŸŒ Red

## 1. `ipconfig` 

Muestra informaciÃ³n sobre la configuraciÃ³n IP del sistema.

| Comando              | DescripciÃ³n                                          |
| -------------------- | ---------------------------------------------------- |
| `ipconfig`           | Muestra la configuraciÃ³n bÃ¡sica de red               |
| `ipconfig /all`      | Muestra informaciÃ³n detallada (MAC, DNS, DHCP, etc.) |
| `ipconfig /release`  | Libera la direcciÃ³n IP obtenida por DHCP             |
| `ipconfig /renew`    | Solicita una nueva direcciÃ³n IP al servidor DHCP     |
| `ipconfig /flushdns` | Limpia la cachÃ© de DNS local                         |

**Ejemplos combinados:**

```cmd
ipconfig /all
```

> Muestra toda la informaciÃ³n de red detallada de cada adaptador.

```cmd
ipconfig /flushdns
```

> Limpia la cachÃ© DNS, Ãºtil cuando hay problemas de resoluciÃ³n de nombres.
 ## 2. `ping` 

EnvÃ­a paquetes ICMP a un destino para comprobar si hay respuesta.

| Comando                 | DescripciÃ³n                                                  |
| ----------------------- | ------------------------------------------------------------ |
| `ping google.com`       | EnvÃ­a 4 paquetes a `google.com`                              |
| `ping 8.8.8.8`          | Comprueba conexiÃ³n directa por IP                            |
| `ping -t google.com`    | EnvÃ­a pings continuos hasta que se interrumpa con `Ctrl + C` |
| `ping -n 10 google.com` | EnvÃ­a 10 paquetes                                            |

**Ejemplos combinados:**

```cmd
ping -n 5 1.1.1.1
```

> EnvÃ­a 5 paquetes a la IP de Cloudflare (`1.1.1.1`).

```cmd
ping -t google.com
```

> Realiza pings continuos a Google para comprobar la estabilidad de la conexiÃ³n.
 ## 3. `tracert` 

Muestra los saltos que siguen los paquetes hasta llegar al destino.

| Comando                 | DescripciÃ³n                                                |
| ----------------------- | ---------------------------------------------------------- |
| `tracert google.com`    | Muestra la ruta de red hasta `google.com`                  |
| `tracert -d google.com` | No resuelve nombres de host, solo muestra IPs (mÃ¡s rÃ¡pido) |

**Ejemplo:**

```cmd
tracert -d openai.com
```

> Rastrea la ruta hacia `openai.com` mostrando Ãºnicamente direcciones IP.
 ## 4. `netstat` 

Muestra informaciÃ³n sobre conexiones TCP/UDP y puertos en uso.

| Comando       | DescripciÃ³n                                          |
| ------------- | ---------------------------------------------------- |
| `netstat`     | Muestra conexiones activas                           |
| `netstat -a`  | Muestra todas las conexiones y puertos en escucha    |
| `netstat -n`  | Muestra direcciones IP en formato numÃ©rico           |
| `netstat -o`  | Incluye el PID del proceso que usa la conexiÃ³n       |
| `netstat -an` | CombinaciÃ³n comÃºn: muestra todo, en formato numÃ©rico |

**Ejemplos combinados:**

```cmd
netstat -an | find "LISTEN"
```

> Muestra Ãºnicamente las conexiones en estado de escucha.

```cmd
netstat -ano > conexiones.txt
```

> Guarda todas las conexiones y puertos activos en un archivo de texto.
 ## 5. `nslookup` 

Consulta informaciÃ³n DNS sobre un dominio o direcciÃ³n IP.

| Comando                       | DescripciÃ³n                                    |
| ----------------------------- | ---------------------------------------------- |
| `nslookup google.com`         | Muestra la IP asociada a un dominio            |
| `nslookup 8.8.8.8`            | Muestra el dominio asociado a una IP (inversa) |
| `nslookup -type=MX gmail.com` | Muestra los registros de correo (MX)           |

**Ejemplos combinados:**

```cmd
nslookup -type=TXT openai.com
```

> Consulta los registros TXT del dominio (por ejemplo, claves SPF o verificaciÃ³n de dominio).
 ## 6. `arp` 

Tabla ARP (asociaciones IP â†” MAC)

| Comando                                 | DescripciÃ³n                    |
| --------------------------------------- | ------------------------------ |
| `arp -a`                                | Muestra la tabla ARP actual    |
| `arp -d *`                              | Elimina todas las entradas ARP |
| `arp -s 192.168.1.50 00-AA-BB-CC-DD-EE` | AÃ±ade una entrada ARP manual   |

**Ejemplos:**

```cmd
arp -a
```

> Muestra todas las direcciones IP y sus direcciones MAC asociadas en la red local.
 ## 7. `net` 

Utilidades de red y usuarios

|Comando|DescripciÃ³n|
|---|---|
|`net user`|Muestra los usuarios locales|
|`net share`|Muestra los recursos compartidos|
|`net view`|Muestra los equipos visibles en la red|
|`net use`|Conecta o desconecta unidades de red|

**Ejemplos combinados:**

```cmd
net use Z: \\Servidor\Recursos /user:Alumno123
```

> Conecta la carpeta compartida `\\Servidor\Recursos` como unidad `Z:`.

```cmd
net view
```

> Muestra los equipos conectados en la red local.
 ## 8. `pathping`  

Combina `ping` y `tracert`
Muestra el recorrido y la latencia promedio de cada salto.

|Comando|DescripciÃ³n|
|---|---|
|`pathping google.com`|Rastrea la ruta e informa de la pÃ©rdida de paquetes en cada salto|

**Ejemplo:**

```cmd
pathping 8.8.8.8
```

> Analiza la ruta hacia el DNS de Google e identifica dÃ³nde se pierden paquetes.
 ## 9. `netsh`  

ConfiguraciÃ³n avanzada de red
Herramienta de lÃ­nea de comandos para configurar interfaces, cortafuegos, Wi-Fi, etc.

|Comando|DescripciÃ³n|
|---|---|
|`netsh wlan show profiles`|Lista las redes Wi-Fi guardadas|
|`netsh wlan show profile "MiRed" key=clear`|Muestra la contraseÃ±a guardada de una red|
|`netsh int ip reset`|Restablece la configuraciÃ³n TCP/IP|
|`netsh advfirewall show allprofiles`|Muestra la configuraciÃ³n actual del firewall|

**Ejemplos combinados:**

```cmd
netsh wlan export profile folder=C:\wifi key=clear
```

> Exporta todas las redes Wi-Fi guardadas (incluyendo contraseÃ±as) a un archivo XML en `C:\wifi`.

```cmd
netsh int ip reset
```

> Restablece el protocolo TCP/IP a su configuraciÃ³n predeterminada.
 ## ğŸ’¡ Consejos Ãºtiles

- Usa `Ctrl + C` para detener comandos como `ping -t` o `pathping`.
    
- `ipconfig /flushdns` ayuda a resolver errores al acceder a pÃ¡ginas web.
    
- Combina `netstat` con `find` para buscar procesos o puertos especÃ­ficos.
    
- `netsh` requiere permisos de administrador para la mayorÃ­a de configuraciones.
    
 